import type { FaqOption } from './types';

export const faq: FaqOption[] = [
	{
		id: '0',
		title: 'این ابزار چگونه کار می‌کند؟',
		content: (
			<p>
				ZWS به جای کاراکترهای معمولی که کوتاه‌کننده‌های لینک استفاده می‌کنند، از کاراکترهای صفرعرض استفاده می‌کند. هنگام
				نمایش، این کاراکترها نامرئی هستند اما همچنان وجود دارند؛ بنابراین ZWS می‌تواند از آن‌ها برای کدگذاری اطلاعات لینک شما
				استفاده کند.
			</p>
		),
	},
	{
		id: '1',
		title: 'چرا انتهای لینک چند کاراکتر می‌بینم؟',
		content: (
			<>
				<p>
					ما تلاش می‌کنیم فقط از کاراکترهایی استفاده کنیم که نمایش داده نمی‌شوند، اما برخی دستگاه‌ها ممکن است آن‌ها را به صورت
					جعبه نشان دهند. اگر چنین چیزی می‌بینید، لطفاً{' '}
					<a
						className='text-zws-purple-400 underline'
						href='https://github.com/zws-im/zws/issues/new'
						target='_blank'
						rel='noreferrer'
					>
						یک گزارش باگ باز کنید
					</a>{' '}
					تا بتوانیم بررسی و برطرفش کنیم!
				</p>
			</>
		),
	},
	{
		id: '2',
		title: (
			<>
				چرا ZWS در <span className='text-zws-purple-400'>[سرویس چت]</span> کار نمی‌کند؟
			</>
		),
		content: (
			<p>
				از آنجا که کاراکترهای صفرعرض رایج نیستند، برخی سرویس‌های چت یا شبکه‌های اجتماعی آن‌ها را حذف می‌کنند که متأسفانه
				باعث می‌شود نتوانید لینک‌های zws.im را در آن پلتفرم‌ها به اشتراک بگذارید.
			</p>
		),
	},
];
export const faqObject = Object.fromEntries(faq.map((option) => [option.id, option]));
export const firstFaqOption = faq[0];

